iRidium-Mobile/BUS77-SDK/Example/STM32/STM32F103C8T6/Template/Bootloader/iRidiumDevice/CDevice.cpp
//////////////////////////////////////////////////////////////////////////
// class CDevice
//////////////////////////////////////////////////////////////////////////
// Включения
#include "stm32f1xx.h"
#include "stm32f1xx_hal.h"
#include "Main.h"
#include "stdlib.h"

// iRidium device
#include "CDevice.h"

// iRidium protocol
#include "IridiumBytes.h"
#include "IridiumCRC16.h"
#include "CIridiumStreebog.h"
#include "CIridiumCipherGrasshopper.h"

// Common
#include "CCanPort.h"
#include "Flash.h"
#include "EEPROM.h"
#include "MemoryMap.h"
#include "CFirmware.h"
#include "InputOutput.h"

#define MAX_DEVICE_CHANNELS            0           // Максимальное количество каналов управления
#define MAX_DEVICE_TAGS                0           // Максимальное количество каналов обратной связи

#define MAX_VARIABLES                  16          // Максимальное количество глобальных переменных на канал управления

#define FIRMWARE_READ_STREAM_ID        1           // Идентификатор потока чтения прошивки
#define FIRMWARE_WRITE_STREAM_ID       2           // Идентификатор потока записи прошивки

///////////////////////////////////////////////////////////////////////////////
// Информация об устройстве
///////////////////////////////////////////////////////////////////////////////
const char g_pszProducer[]    = "iRidium";
const char g_pszModelName[]   = "Шаблон 1.0";

char g_pszHWID[STREEBOG_HASH_256_BYTES + 1];       // Аппаратный идентификатор шеснадцатеричное представление 128 битного числа + 1 байт

typedef struct eeprom_device_s
{
   // Обшая структура данных (для загрузчика и прошивки)
   eeprom_common_t   m_Common;
   // Резервирование памяти
   u8                m_aReserve[FLASH_PAGE_SIZE - sizeof(eeprom_common_t)];
} eeprom_device_t;

eeprom_device_t   g_EEPROM;                          // Буфер с данными энергонезависимой памяти

// Информация об устройстве
const iridium_device_info_t g_DeviceInfo =
{
   IRIDIUM_GROUP_TYPE_ACTUATOR,
   g_EEPROM.m_Common.m_szDeviceName,
   (char*)g_pszProducer,
   (char*)g_pszModelName,
   (char*)g_pszHWID,
   DCT_MICROCONTROLLER,
   PT_ARM,
   OST_NONE,
   IRIDIUM_DEVICE_FLAG_FIRMWARE | IRIDIUM_DEVICE_FLAG_ACTUATOR,
   0,
   { 0, 0, 0 },
   0,
   0
};

// Ключ шифрования и вектор инициализации по умолчанию
const u8 g_aKeyAndIV[] =
{
   // Ключ шифрования
   0x00, 0x01, 0x02, 0x03, 0x04, 0x05, 0x06, 0x07, 0x08, 0x09, 0x0a, 0x0b, 0x0c, 0x0d, 0x0e, 0x0f,
   0xf0, 0xe0, 0xd0, 0xc0, 0xb0, 0xa0, 0x90, 0x80, 0x70, 0x60, 0x50, 0x40, 0x30, 0x20, 0x10, 0x00,
   // Вектор инициалиазции
   0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00
};

bool                       g_bPress = false;
u32                        g_u32LEDTime = 0;
u32                        g_u32FirmwareSize = 0;  // Размер прошивки
u16                        g_u16FirmwareCRC = 0;   // Контрольная сумма прошивки
CFirmware                  g_Firmware;             // Прошивка устройства
CIridiumCipherGrasshopper  g_Cipher;               // Шифр для декодирования прошивки

// Для работы с временем, количество тиков в 1 микросекунде
volatile u32               g_u32TickPerUs = HAL_RCC_GetHCLKFreq() / 1000000;

CDevice                    g_Device;               // Данные объекта

// Указатель на данные HAL CAN порта
extern CAN_HandleTypeDef   hcan;

static CanTxMsgTypeDef  g_aCanTxMessage;           // Структура для отправляемого сообщения
static CanRxMsgTypeDef  g_aCanRxMessage;           // Структура для принимаемого сообщения

// Параметры CAN порта для сборки и разборки пакетов
CCANPort                g_ExtCAN;                  // Данные внешнего CAN порта
can_frame_t             g_aCANInBuffer[256];       // Массив для приема и сборки CAN пакетов
can_frame_t             g_aCANOutBuffer[33*8];     // Массив для отправки CAN пакетов
u16                     g_u16CANID = 0;            // Идентификатор CAN

// Индексы кнопок
enum eButton
{
   BUTTON_ONBOARD = 0,                             // Индекс набортной кнопки
};

// Массив для работы с бинарными входами
digital_input_t   g_aInputs[] =
{
   Onboard_Button_GPIO_Port, Onboard_Button_Pin, 0, 0, 0, { false, false, false, true }
};

/**
   Получение указателя на порт по хэндлеру CAN порта
   на входе    :  in_pCanHandle  - указатель на хэндлер порта
   на выходе   :  указатель на данные порта
*/
CCANPort* GetCANPort(CAN_HandleTypeDef* in_pCanHandle)
{
   CCANPort* l_pResult = NULL;

   // Проверка на нужный порт
   if(in_pCanHandle->Instance == CAN1)
      l_pResult = &g_ExtCAN;
   
   return l_pResult;
}

/**
   Блокирование доступа к CAN порту
   на входе    :  in_pCanHandle  - указатель на хэндлер порта
   на выходе   :  *
*/
void LockCANPort(CAN_HandleTypeDef* in_pCanHandle)
{
   // Проверка на нужный порт
   if(in_pCanHandle->Instance == CAN1)
   {
      // Выключение прерываний CAN 1 на время сдвига буфера во избежании потери данных
      HAL_NVIC_DisableIRQ(CAN1_RX1_IRQn);
      HAL_NVIC_DisableIRQ(CAN1_RX0_IRQn);
   }
}

/**
   Блокирование доступа к CAN порту
   на входе    :  in_pCanHandle  - указатель на хэндлер порта
   на выходе   :  *
*/
void UnLockCANPort(CAN_HandleTypeDef* in_pCanHandle)
{
   // Проверка на нужный порт
   if(in_pCanHandle->Instance == CAN1)
   {
      // Включение прерываний CAN 1
      HAL_NVIC_EnableIRQ(CAN1_RX1_IRQn);
      HAL_NVIC_EnableIRQ(CAN1_RX0_IRQn);
   }
}

/**
   Отправка прерывания приема пакета с CAN
   на входе    :  in_pCanHandle - указатель на структуру CAN
   на выходе   :  *
*/
void HAL_CAN_RxCpltCallback(CAN_HandleTypeDef* in_pCanHandle)
{
   can_frame_t l_Frame;

   // Получение указателя на CAN порт
   CCANPort* l_pPort = GetCANPort(in_pCanHandle);
   if(l_pPort)
   {
      // Извлечение полезной информации
      l_Frame.m_u32ExtID   = in_pCanHandle->pRxMsg->ExtId;
      l_Frame.m_u8Size     = in_pCanHandle->pRxMsg->DLC;

      // Скопируем полезную нагрузку
      memcpy(l_Frame.m_aData, in_pCanHandle->pRxMsg->Data, l_Frame.m_u8Size);

      // Добавление полученого фрейма в буфер
      l_pPort->AddFrame(&l_Frame);

