iRidium-Mobile/BUS77-SDK/Example/STM32/STM32F103C8T6/Template/Bootloader/iRidiumDevice/CDevice.cpp
      // Включим прерыване обратно
      HAL_CAN_Receive_IT(in_pCanHandle, CAN_FIFO0);
   }
}

/////////////////////////////////////////////////////////////////////////////////////////////////
//// Работа с шиной
/////////////////////////////////////////////////////////////////////////////////////////////////

/**
   Инициализация шины
   на входе    :  *
   на выходе   :  *
   примечание  :  микроконтроллер stm32f205vgt5 имеет два CAN порта. При этом CAN1 это master, а CAN2 это slave
                  это означает что CAN1 и CAN2 имеют блок фильтров один на двоих, то есть от 0 до 13 это фильтры
                  для CAN1, а фильтры от 14 по 27 это фильтры для CAN2
*/
void BUS_Init()
{
   // Настройка внешней шины
   hcan.pRxMsg = &g_aCanRxMessage;
   hcan.pTxMsg = &g_aCanTxMessage;

   // Установка фильтра CAN1, прием всех сообщений
   CAN_FilterConfTypeDef CAN_FilterInitStructure;
   CAN_FilterInitStructure.FilterIdHigh = 0x0000;
   CAN_FilterInitStructure.FilterIdLow = 0x0000;
   CAN_FilterInitStructure.FilterMaskIdHigh = 0x0000;
   CAN_FilterInitStructure.FilterMaskIdLow = 0x0000;
   CAN_FilterInitStructure.FilterFIFOAssignment = CAN_FIFO0;
   CAN_FilterInitStructure.FilterNumber = 0;
   CAN_FilterInitStructure.FilterMode = CAN_FILTERMODE_IDMASK;
   CAN_FilterInitStructure.FilterScale = CAN_FILTERSCALE_32BIT;
   CAN_FilterInitStructure.FilterActivation = ENABLE;
   CAN_FilterInitStructure.BankNumber = 14;                 // Важно заполнить это поле
   HAL_CAN_ConfigFilter(&hcan, &CAN_FilterInitStructure);

   HAL_CAN_Receive_IT(&hcan, CAN_FIFO0);

   g_ExtCAN.SetCANID(0);
   g_ExtCAN.SetTID(0x00);
   g_ExtCAN.SetAddress(0);
   g_ExtCAN.SetInBuffer(g_aCANInBuffer, sizeof(g_aCANInBuffer));
   g_ExtCAN.SetOutBuffer(g_aCANOutBuffer, sizeof(g_aCANOutBuffer));
}

/**
   Инициализация фильтров шины
   на входе    :  in_u16CanID    - идентификатор CAN шины
                  in_u8Address   - адрес внешней шины
   на выходе   :  *
   примечание  :  параметры фильтра
                  [               3 байт ][               2 байт ][               2 байт ][               2 байт ]
                   31 30 29 28 27 26 25 24 23 22 21 20 19 18 17 16 15 14 13 12 11 10  9  8  7  6  5  4  3  2  1  0
                  [X][X][X][I][I][I][I][I][I][I][I][I][I][I][I][I][I][I][I][T][T][T][B][A][A][A][A][A][A][A][A][E]
                  где   :
                  X  - Резерв, должно быть равно 0
                  I  - Идентификатор CAN устройства
                  T  - Идентификатор транзакции
                  B  - Признак широковещательного фрейма (0 - адресный фрейм, 1 - широковещательный фрейм)
                  A  - Адрес кому предназначен фрейм, если признак широковещательного фрейма равен 1, значение должно быть равно 0
                  E  - Признак замыкающего фрейма
*/
void BUS_SetFilter(u16 in_u16CanID, u8 in_u8Address)
{
   // Установка идентификатора
   g_ExtCAN.SetCANID(in_u16CanID);
   g_ExtCAN.SetAddress(in_u8Address);
   
   // Настройка фильтра 0 (CAN1) для приема широковещательных фреймов
   // Маска          :  1 00000000 0   маска на 10 бит
   // Идентификатор  :  1 00000000 0   10 бит включен (признак широковещательного фрейма)
   CAN_FilterConfTypeDef CAN_FilterInitStructure;
   CAN_FilterInitStructure.FilterIdHigh = 0x0000;
   CAN_FilterInitStructure.FilterIdLow = 0x0200 << 3;
   CAN_FilterInitStructure.FilterMaskIdHigh = 0x0000;
   CAN_FilterInitStructure.FilterMaskIdLow = 0x0200 << 3;
   CAN_FilterInitStructure.FilterFIFOAssignment = CAN_FIFO0;
   CAN_FilterInitStructure.FilterNumber = 0;
   CAN_FilterInitStructure.FilterMode = CAN_FILTERMODE_IDMASK;
   CAN_FilterInitStructure.FilterScale = CAN_FILTERSCALE_32BIT;
   CAN_FilterInitStructure.FilterActivation = ENABLE;
   CAN_FilterInitStructure.BankNumber = 0;        // Важно заполнить это поле
   HAL_CAN_ConfigFilter(&hcan, &CAN_FilterInitStructure);
   
   // Настройка фильтра 1 (CAN1) для приема адресного фрейма
   // Маска          :  1 11111111 0   маска на 10 бит
   // Идентификатор  :  0 AAAAAAAA 0   10 бит выключен (признак адресного фрейма), биты от 9-1 адрес
   CAN_FilterInitStructure.FilterIdHigh = 0x0000;
   CAN_FilterInitStructure.FilterIdLow = in_u8Address << (3 + 1);
   CAN_FilterInitStructure.FilterMaskIdHigh = 0x0000;
   CAN_FilterInitStructure.FilterMaskIdLow = 0x03FE << 3;
   CAN_FilterInitStructure.FilterFIFOAssignment = CAN_FIFO0;
   CAN_FilterInitStructure.FilterNumber = 1;
   CAN_FilterInitStructure.FilterMode = CAN_FILTERMODE_IDMASK;
   CAN_FilterInitStructure.FilterScale = CAN_FILTERSCALE_32BIT;
   CAN_FilterInitStructure.FilterActivation = ENABLE;
   CAN_FilterInitStructure.BankNumber = 0;        // Важно заполнить это поле
   HAL_CAN_ConfigFilter(&hcan, &CAN_FilterInitStructure);

   HAL_CAN_Receive_IT(&hcan, CAN_FIFO0);
}

/**
   Отправка сообщения на шину
   на входе    :  in_bBroadcast  - признак широковещательно пакета
                  in_u8Address   - адрес кому предназначен пакет
                  in_pBuffer     - указатель на отправляемые данные
                  in_stSize      - размер отправляемых данных
   на выходе   :  успешность отправки данных
*/
bool BUS_Write(bool in_bBroadcast, u8 in_u8Address, void* in_pBuffer, size_t in_stSize)
{
   return g_ExtCAN.AddPacket(in_bBroadcast, in_u8Address, in_pBuffer, in_stSize);
}

/**
   Перезагрузка микроконтроллера
   на входе    :  *
   на выходе   :  *
*/
void Reboot()
{
   NVIC_SystemReset();
}

/**
   Генерация HWID устройства
   на входе    :  in_pHWID    - указатель на буфер куда нужно поместить строку с HWID
                  in_stSize   - размер буфера
   на выходе   :  успешность получения
   примечание  :  HWID это строка шеснадцатеричного представления 16 байтного значения.
                  Длинна строки 33 байта (32 байта + 1 байт конец)
*/
static void GenerateHWID()
{
   char l_szHexTab[] = "0123456789ABCDEF";
   u8 l_aHash[STREEBOG_BLOCK_SIZE];
   CIridiumStreebog l_Streebog;
   
   // Вычисление хэша для 96 битного идентификатора устройства
   l_Streebog.Calc((const void*)UID_BASE, 12, l_aHash, sizeof(l_aHash), SHT_HASH_256);

