iRidium-Mobile/BUS77-SDK/Example/STM32/STM32F103C8T6/Template/Bootloader/iRidiumDevice/CDevice.cpp
   // Преобразование хэша в строку
   char* l_pszHWID = g_pszHWID;
   for(size_t i = 0; i < STREEBOG_HASH_256_BYTES / 2; i++)
   {
      u8 l_u8Byte = l_aHash[i] ^ l_aHash[STREEBOG_HASH_256_BYTES / 2 + i];
      *l_pszHWID++ = l_szHexTab[l_u8Byte >> 4];
      *l_pszHWID++ = l_szHexTab[l_u8Byte & 0xF];
   }
   *l_pszHWID = 0;
}

/**
   Конструктор класса
   на входе    :  *
*/
CDevice::CDevice() : CIridiumBusProtocol()
{
   // Настройка входящего буфера
   m_InBuffer.SetBuffer(m_aInBuffer, IRIDIUM_BUS_IN_BUFFER_SIZE);
   m_InBuffer.Clear();
   
   // Настройка исходящего буфера
   m_OutBuffer.SetBuffer(IRIDIUM_BUS_MAX_HEADER_SIZE, IRIDIUM_BUS_CRC_SIZE, m_aOutBuffer, sizeof(m_aOutBuffer));
   m_OutBuffer.Clear();
}

/**
   Деструктор класса
*/
CDevice::~CDevice()
{
	
}

//////////////////////////////////////////////////////////////////////////
// Перегруженные методы для взаимодействия с протоколом
//////////////////////////////////////////////////////////////////////////
/**
   Отправка буфера на устройство
   на входе    :  in_pBuffer  - указатель на буфер с данными
                  in_stSize   - размер данных
   на выходе   :  успешность отправки
*/
bool CDevice::SendPacket(bool in_bBroadcast, iridium_address_t in_Address, void* in_pBuffer, size_t in_stSize)
{
   while(1)
   {
      // Попробуем отправить буфер в шину
      if(!BUS_Write(in_bBroadcast, in_Address, in_pBuffer, in_stSize))
      {
         // Отправка во внешний CAN порт во время простоя
         WriteToExtCan();
      } else
         break;
   }
   return true;
}

/**
   Сравнение HWID
   на входе    :  in_pszHWID  - указатель на строку с аппаратным идентификатором
   на выходе   :  false - HWID не совпадает
                  true  - HWID совпадают
*/
bool CDevice::CompareHWID(const char* in_pszHWID)
{
   // Проверка входящего параметра
   return (in_pszHWID && !strcmp(in_pszHWID, g_pszHWID)) ? true : false;
}

/**
   Установка локального идентификатора
   на входе    :  in_u8LID - локальный идентификатор устройства
   на выходе   :  *
*/
void CDevice::SetLID(u8 in_u8LID)
{
   // Запись локального идентификатора в энергонезависимую память
   g_EEPROM.m_Common.m_u8LID = in_u8LID;
   m_Address = g_EEPROM.m_Common.m_u8LID;
   // Изменение фильтра
   BUS_SetFilter(g_u16CANID, m_Address);
   // Запись в энергонезависимую память
   EEPROM_NeedSaveBuffer();
}

/**
   Проверка возможности выполнения операции
   на входе    :  in_eType    - тип операции
                  in_u32PIN   - пароль для доступа
                  in_pData    - указатель на данные
   на выходе   :  > 0   - операция доступна
                  = 0   - операция не доступна так как пароль не соответствует
                  < 0   - слишком много неудачных попыток, некоторое время доступ к значению канала будет заблокирован
*/
s8 CDevice::CheckOperation(eIridiumOperation in_eType, u32 in_u32PIN, void* in_pData)
{
   s8 l_s8Result = 0;

   // Получение текущего PIN кода
   u32 l_u32PIN = g_EEPROM.m_Common.m_u32PIN;

   // Проверка наличия PIN кода, если PIN кода нет, то проверка всегда дает положительный результат
   if(l_u32PIN)
   {
      switch(in_eType)
      {
         // Проверка возможности изменения значения локального адреса
         case IRIDIUM_OPERATION_TEST_PIN:
            l_s8Result = (l_u32PIN == in_u32PIN);
            break;

         // Запись потока
         case IRIDIUM_OPERATION_WRITE_STREAM:
            l_s8Result = 1;
            break;

         default:
            l_s8Result = 0;
      }
   } else
      l_s8Result = 1;

   return l_s8Result;
}

/**
   Получение информации об устройстве
   на входе    :  out_rInfo   - ссылка на структуру куда надо поместить данные об устройстве
   на выходе   :  *
*/
bool CDevice::GetSearchInfo(iridium_search_info_t& out_rInfo)
{
   // Заполнение информации об устройстве
   out_rInfo.m_u8Group  = IRIDIUM_GROUP_TYPE_ACTUATOR;
   out_rInfo.m_pszHWID  = (char*)g_pszHWID;
   return true;
}

/**
   Получение информации об устройстве
   на входе    :  out_rInfo   - ссылка на структуру куда надо поместить данные об устройстве
   на выходе   :  *
*/
bool CDevice::GetDeviceInfo(iridium_device_info_t& out_rInfo)
{
   bool l_bResult = true;
   // Копирование информации об устройстве
   memcpy(&out_rInfo, &g_DeviceInfo, sizeof(iridium_device_info_t));
   // Информация о каналах
   out_rInfo.m_u32Channels = GetChannels();
   out_rInfo.m_u32Tags = GetTags();
   return l_bResult;
}

/**
   Обработчик получения запроса на открытие потока
   на входе    :  in_pszName  - имя потока
                  in_eMode    - режим открытия потока
   на выходе   :  идентификатор открытого потока, если поток не был открыт возвражаемый результат равен 0
*/
u8 CDevice::StreamOpen(const char* in_pszName, eIridiumStreamMode in_eMode)
{
   u8 l_u8Result = 0;
   // Проверка имени запрашиваемого потока
   if(!g_Firmware.IsOpen() && in_pszName && !strcmp(in_pszName, FIRMWARE_NAME))
   {
      // Проверка на открытие потока для чтения или записи
      if(in_eMode == IRIDIUM_STREAM_MODE_WRITE)
      {
         l_u8Result = FIRMWARE_WRITE_STREAM_ID;
         // Установка адреса
         g_Firmware.SetAddress(GetSrcAddress());
         // Установка идентиифкатора потока
         g_Firmware.SetStreamID(l_u8Result);
         // Установка идентификатора блока
         g_Firmware.SetBlockID(0);
         // Установка времени по истечение которого нужно закрыть поток
         g_Firmware.SetTime(HAL_GetTick() + FIRMWARE_WAIT_TIME);
         // Установка данных потока
         g_Firmware.Open((u8*)FIRMWARE_START, FIRMWARE_SIZE);
      }
   }
   return l_u8Result;
}

/**
   Обработчик получения ответа на запрос открытия потока
   на входе    :  in_pszName     - имя потока
                  in_eMode       - режим открытия потока
                  in_u8StreamID  - идентификатор потока
   на выходе   :  *
*/
void CDevice::StreamOpenResult(const char* in_pszName, eIridiumStreamMode in_eMode, u8 in_u8StreamID)
{
}

/**
   Обработчик получения запроса передачи данных блока
   на входе    :  in_u8StreamID  - идентификатор потока
                  in_u8BlockID   - идентификатор блока
                  in_stSize      - размер данных блока
                  in_pBuffer     - указатель на буфер с данными блока
   на выходе   :  количество обработанных данных
*/
size_t CDevice::StreamBlock(u8 in_u8StreamID, u8 in_u8BlockID, size_t in_stSize, const void* in_pBuffer)
{
   u8 l_u8Marker = 0;
   u32 l_u32Size = 0;
   u16 l_u16CRC = 0;
   u8* l_pBuffer = (u8*)in_pBuffer;
   size_t l_stSize = in_stSize;
   bool l_bFirst = false;
   
   // Проверка был ли откры поток, идентификатора потока и размер данных
   if(g_Firmware.IsOpen() && g_Firmware.GetStreamID() == in_u8StreamID && in_stSize >= 16)
   {
      // Проверка на первый блок
      l_bFirst = (g_Firmware.GetPtr() == (u8*)FIRMWARE_START);
      
      // Проверка начала записи данных
      if(l_bFirst)
      {
         // Инициализация блочного шифра
         g_Cipher.EnableIV(true);
         g_Cipher.Init(g_aKeyAndIV);
      }
      
      // Декодирование полученого блока
      g_Cipher.Decode((u8*)in_pBuffer, in_stSize);
      
      // Разблокируем флеш
      HAL_FLASH_Unlock();
      
      // Проверка начала записи данных
      if(l_bFirst)
      {
         // Чтение случайного числа, маркера, размера и контрольной суммы прошивки из заголовка
         l_pBuffer = ReadByte(l_pBuffer, l_u8Marker);
         l_pBuffer = ReadByte(l_pBuffer, l_u8Marker);
         l_pBuffer = ReadLE(l_pBuffer, &l_u32Size, 4);
         l_pBuffer = ReadLE(l_pBuffer, &l_u16CRC, 2);
         // Уменьшение размера данных на размер заголовка
         l_stSize -= (l_pBuffer - (u8*)in_pBuffer);
         
         // Проверка размера и маркера
         if(l_u32Size && l_u8Marker == 0x77)
         {
            // Запись информации о прошивке
            g_EEPROM.m_Common.m_u8Mode = BOOTLOADER_MODE_RUN;
            g_EEPROM.m_Common.m_u32FirmwareSize = l_u32Size;
            g_EEPROM.m_Common.m_u16FirmwareCRC16 = l_u16CRC;
            
            // Очистка памяти
            size_t l_stStart = (size_t)g_Firmware.GetPtr();
            size_t l_stEnd = (size_t)(g_Firmware.GetPtr() + g_Firmware.GetSize());
            FLASH_Clear(l_stStart, l_stEnd);
         } else
         {
            // Ошибка: маркер не найден
            in_stSize = 0;
         }
      }
      
      // Проверка на ошибку
      if(in_stSize)
      {
         // Запись во флеш память
         FLASH_Write((u8*)l_pBuffer, (size_t)g_Firmware.GetPtr(), l_stSize);
         // Сдвиг позиции
         g_Firmware.Skip(l_stSize);
         // Установка времени по истечению которого нужно закрыть поток
         g_Firmware.SetTime(HAL_GetTick() + FIRMWARE_WAIT_TIME);
      } else
      {
         // Установим текущее время чтобы закрыть поток
         g_Firmware.SetTime(HAL_GetTick());
      }
      
      // Заблокируем флеш
      HAL_FLASH_Lock();

      // Сохранение информации о прошивке
      if(l_bFirst)
         EEPROM_ForceSaveBuffer();
   }
   return in_stSize;
}

/**
   Обработчик получения ответа на запрос передачи данных блока
   на входе    :  in_u8StreamID  - идентификатор потока
                  in_u8BlockID   - идентификатор блока
                  in_stSize      - количество обработанных данных
   на выходе   :  *
*/
void CDevice::StreamBlockResult(u8 in_u8StreamID, u8 in_u8BlockID, size_t in_stSize)
{
	
