iRidium-Mobile/BUS77-SDK/Example/STM32/STM32F103C8T6/Template/Bootloader/iRidiumDevice/CDevice.cpp
}

/**
   Обработчик закрытия потока
   на входе    :  in_u8StreamID  - идентификатор потока
   на выходе   :  *
*/
void CDevice::StreamClose(u8 in_u8StreamID)
{
   // Проверка закрываемого потока
   if(g_Firmware.IsOpen() && g_Firmware.GetStreamID() == in_u8StreamID)
   {
      // Очистка прошивки
      g_Firmware.Close();
      
      // Запишем в энергонезависимую память состояние
      g_EEPROM.m_Common.m_u8Mode = BOOTLOADER_MODE_RUN;
      EEPROM_ForceSaveBuffer();
      
      // Осуществим переход в загрузчик через сброс контроллера
      Reboot();
   }
}

/**
   Инициализация устройства
   на входе    :  *
   на выходе   :  *
*/
void CDevice::Setup()
{
   iridium_search_info_t l_Search;
   // Загрузка локального идентификатора
   m_Address = g_EEPROM.m_Common.m_u8LID;

   // Поставим конец строки на всякий случай
   g_EEPROM.m_Common.m_szDeviceName[sizeof(g_EEPROM.m_Common.m_szDeviceName) - 1] = 0;

   // Генерация идентификатора
   GenerateHWID();
   
   // Обнуление PIN при первом запуске 
   if(g_EEPROM.m_Common.m_u32PIN == 0xFFFFFFFF)
      g_EEPROM.m_Common.m_u32PIN = 0;
   
   // Инициализация шины
   BUS_Init();
   
   // Установка фильтров
   g_u16CANID = GetCRC16Modbus(1, (u8*)g_pszHWID, sizeof(g_pszHWID));
   BUS_SetFilter(g_u16CANID, m_Address);

   // Ожидание в течении 50 миллисекунд нажатия набортной кнопки
   u32 l_u32Time = HAL_GetTick();
   while((HAL_GetTick() - l_u32Time) < 50)
      IO_UpdateInput(g_aInputs, sizeof(g_aInputs) / sizeof(g_aInputs[BUTTON_ONBOARD]));

   // Получение состояния набортной кнопки
   g_bPress = g_aInputs[BUTTON_ONBOARD].m_Flags.m_bCurValue;

   // Отправка информации об устройстве
   if(GetSearchInfo(l_Search))
      SendSearchResponse(GetTID(), l_Search);

   // Выставим режим запуска прошивки, если не режим ожидания прошивки
   u8 l_u8Mode = g_EEPROM.m_Common.m_u8Mode;
   if(l_u8Mode != BOOTLOADER_MODE_DOWNLOAD)
   {
      g_EEPROM.m_Common.m_u8Mode = BOOTLOADER_MODE_RUN;
      EEPROM_ForceSaveBuffer();
   }
}

/**
   Основной цикл работы устройства
   на входе    :  *
   на выходе   :  *
*/
void CDevice::Loop()
{
   // обработка нажатий
   WorkInputs();
   
   // Обработка сохранения изменений
   EEPROM_WorkBuffer();
   
   // Запись во внешний CAN порт
   WriteToExtCan();

   // Чтение и обработка данных с внешнего CAN порта
   ReadFromExtCan();

   // Получение режима работы
   u8 l_u8Mode = g_EEPROM.m_Common.m_u8Mode;
   
   // Если загрузчик находится в режиме загрузки прошивки
   if(l_u8Mode == BOOTLOADER_MODE_DOWNLOAD)
   {
      iridium_packet_header_t l_PH;
      m_pInPH = &l_PH;
      
      // Переход в режим получения прошивки
      g_EEPROM.m_Common.m_u8Mode = BOOTLOADER_MODE_RUN;
      EEPROM_ForceSaveBuffer();
      
      // Открытие потока
      u8 l_u8Stream = StreamOpen(FIRMWARE_NAME, IRIDIUM_STREAM_MODE_WRITE);
      
      // Получение параметров для отправки
      m_pInPH->m_SrcAddr         = g_EEPROM.m_Common.m_u16FirmwareAddress;
      m_InMH.m_Flags.m_u4Version = GetMessageVersion(IRIDIUM_MESSAGE_STREAM_OPEN);
      m_InMH.m_u8Type            = IRIDIUM_MESSAGE_STREAM_OPEN;
      m_InMH.m_u16TID            = g_EEPROM.m_Common.m_u16FirmwareTID;
      // Отправка ответа
      SendStreamOpenResponse(FIRMWARE_NAME, IRIDIUM_STREAM_MODE_WRITE, l_u8Stream);

      g_bPress = false;
   }

   // Контроль работы прошивки
   if(g_Firmware.IsOpen())
   {
      // Если время равно 0 или время вышло, закроем поток
      if(g_Firmware.GetTime() < HAL_GetTick())
      {
         // Пошлем сообщение что поток закрыт
         SendStreamCloseRequest(g_Firmware.GetAddress(), g_Firmware.GetStreamID());
         // Закроем поток
         g_Firmware.Close();
         
         // Запишем в энергонезависимую память состояние
         g_EEPROM.m_Common.m_u8Mode =  BOOTLOADER_MODE_RUN;
         EEPROM_ForceSaveBuffer();
         
         // Осуществим переход в загрузчик через сброс контроллера
         Reboot();
      }
   }

   // Мигание набортного светодиода если не было зажатия набортной кнопки
   if(!g_bPress && HAL_GetTick() - g_u32LEDTime > 1000)
   {
      HAL_GPIO_TogglePin(Onboard_LED_GPIO_Port, Onboard_LED_Pin);
      g_u32LEDTime = HAL_GetTick();
   }
}

/**
   Цикл обработки нажатий
   на входе    :  *
   на выходе   :  *
*/
void CDevice::WorkInputs()
{
   iridium_search_info_t l_Search;
   // Обработка нажатий
   IO_UpdateInput(g_aInputs, sizeof(g_aInputs) / sizeof(g_aInputs[BUTTON_ONBOARD]));

   // Проверка была ли зажата набортная кнопка при старте
   if(g_bPress)
   {
      // Если набортаная кнопка была зажата на 5 секунд, произведем сброс данных
      if(g_aInputs[BUTTON_ONBOARD].m_Flags.m_bCurValue && (HAL_GetTick() - g_aInputs[BUTTON_ONBOARD].m_u32ChangeTime) > 5000)
      {
         // Индикация сброса параметров
         for(size_t i = 0; i < 10; i++)
         {
            HAL_GPIO_TogglePin(Onboard_LED_GPIO_Port, Onboard_LED_Pin);
            HAL_Delay(100);
         }

         // Сбросим PIN код
         g_EEPROM.m_Common.m_u32PIN = 0;
         // Отметим что устройство надо сбросить
         g_EEPROM.m_Common.m_u8FirmwareID = 0xFF;
         // Сброс ключа шифрования
         for(size_t i = 0; i < BLOCK_CIPHER_KEY_SIZE; i++)
            g_EEPROM.m_Common.m_aKey[i] = 0;

         // Запись режима загрузки устройства
         g_EEPROM.m_Common.m_u8Mode = BOOTLOADER_MODE_RUN;
         // Насильная запись данных во флешь память
         EEPROM_ForceSaveBuffer();
         // Перезагрузка контроллера
         HAL_Delay(100);
         Reboot();
      }

      // Проверка изменения значения набортной кнопки
      if(g_aInputs[BUTTON_ONBOARD].m_Flags.m_bChange && !g_aInputs[BUTTON_ONBOARD].m_Flags.m_bCurValue)
      {
         eBootloaderMode l_eMode = BOOTLOADER_MODE_RUN;
         // Проверка на переход в режим бутлоадера
         if(g_aInputs[BUTTON_ONBOARD].m_u32IntervalTime >= 1000)
         {
            // Индикация перехода в режим бутлоадера
            for(size_t i = 0; i < 3; i++)
            {
               HAL_GPIO_TogglePin(Onboard_LED_GPIO_Port, Onboard_LED_Pin);
               HAL_Delay(300);
            }
            // Переход в режим бутлоадера
            l_eMode = BOOTLOADER_MODE_BOOT;
         }
         // Запись режима загрузки устройства
         g_EEPROM.m_Common.m_u8Mode = l_eMode;
         // Насильная запись данных во флешь память
         EEPROM_ForceSaveBuffer();
         // Перезагрузка контроллера
         Reboot();
      }
   } else
   {
      // Если была нажата набортная кнопка, пошлем в шину информацию о себе
      if(g_aInputs[BUTTON_ONBOARD].m_Flags.m_bChange && g_aInputs[BUTTON_ONBOARD].m_Flags.m_bCurValue)
      {
         // Получение информации об устройстве
         if(GetSearchInfo(l_Search))
         {
            // Отправка информации в шину
            SendSearchResponse(GetTID(), l_Search);
         }
      }
   }
}

/**
   Обработка внешнего порта
   на входе    :  *
   на выходе   :  *
*/
void CDevice::ReadFromExtCan()
{
   // Поиск пакета в буфере
   void* l_pBuffer = NULL;
   size_t l_stSize = 0;
   bool l_bResult = false;
   
   // Получение указателя на данные порта
   CCANPort* l_pPort = GetCANPort(&hcan);
   if(l_pPort)
   {
      // Чтение входящих сообщений
      HAL_CAN_Receive_IT(&hcan, CAN_FIFO0); 

      // Получение пакета
      l_bResult = l_pPort->GetPacket(l_pBuffer, l_stSize);
      
      // Блокирование доступа к порту
      LockCANPort(&hcan);
      // Удаление обработанных пакетов
      l_pPort->Flush();
      // Разблокирование доступа к порту
      UnLockCANPort(&hcan);
      
      // Проверка наличия данных
      if(l_bResult)
      {
         // Установка данных буфера
         m_InBuffer.SetBuffer(l_pBuffer, l_stSize);
   
